Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PortDefaultBase::Modifier Class Reference
MEP Element Manager
Modifier of the PortDefaultBase. More...
#include <MEPPortDefaultBase.hpp>
 Inheritance diagram for ACAPI::MEP::PortDefaultBase::Modifier:
 Public Member Functions
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
Detailed Description
Modifier of the PortDefaultBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PortDefaultBase::Modifier::Modifier  |  ( |  PortDefaultBase & |  parent | )
protected
Constructs a Modifier with the given PortDefaultBase parent.
Parameters
parent | The parent PortDefaultBase.
Member Function Documentation
◆ SetMEPSystem()
 void ACAPI::MEP::PortDefaultBase::Modifier::SetMEPSystem  |  ( |  const API_AttributeIndex & |  attributeIndex | )
Sets the MEPSystem attribute of a Port.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
◆ SetShape()
 void ACAPI::MEP::PortDefaultBase::Modifier::SetShape  |  ( |  ConnectorShape |  shape | )
Sets the shape of the port.
Parameters
shape | The shape to be set.
◆ SetWidth()
 void ACAPI::MEP::PortDefaultBase::Modifier::SetWidth  |  ( |  double |  width | )
Sets the width of the port.
Parameters
width | The value to be set.